
[
    {
      "id":1,
     "vidSource":"https://www.youtube.com/embed/TlB_eWDSMt4",
     "title":"Node.js Tutorial for Beginners: Learn Node in 1 Hour",
     "comments":[
      " Want to master Node.js?\n- Check out my complete course: https://mosh.link/nodejs-course\n- Subscribe for more awesome content: https://goo.gl/6PYaGF",
      "Great tutorial. Some minor changes now in 2024: VSCode expects the imports and exports to be written in ES6 format, but you can just ignore those warnings.\n\nAlso, if you want to use promise style event handling instead of callbacks, some libraries like fs has the property .promises to get the same functions but with promises:\n\nconst fs = require('fs').promises;",
      "جناب همدانی خیلی عالیه . با این ویدیو واقعا علاقه مند به node js شدم. قبلا جسته و گریخته و با اکراه ازین ور و اون ور یادگرفته بودم. اما این آموزش خیلی اصولی بود و جوانب مختلف رو دیده بود که باعث شد واقعا بهش علاقه مند بشم. متشکرم",
      "Test due in an hour and 30 mins. Let’s goooooooooooooo",
      "the music so therapic and it make me sleep.",
      "thanks",
      "Project due tomorrow. 1.75 speed. Let’s go",
      "This guy deserves serious appreciation for sure. sharing such a wealthy knowledge for free of cost",
      "I watched this right before an interview, and the question about windows came up. I never knew about Node.js. I answered right that there is no windows object in Node and the interviewer was like you got it right, it was a tricky question. Thanks, Mosh. I will be going to the final step of the interview next week. Wish me luck all.\n\nI Got the Job ",
      "Thanks Sir",
      "\"I started learning Node.JS after a breakup.\"",
      "There's a difference between knowing something well and TEACHING it well. You have both rare skillsets my friend. Thank you, from a 56-year-old expanding his knowledge base. I will be signing up for your courses.",
      "how can i do that by windows \nplease",
      "Great video, still a great place to start in 2021",
      "you're the perfect guy to hold the Javascript mic.\nBig up for your efforts ..\nthank you soo soo much\n..",
      "IT'S HARD TO FIND WORDS TO DESCRIBE HOW GOOD YOU ARE MOSH! I JUST WANNA SAY THANK YOOU, YOU'RE DOING AN AMAZING WORK! FROM BRAZIL",
      "I learned a lot from a 5 year old video. So simple, so clear, so good. Thanks.",
      "Very nice video, thanks! Can I ask you why you start write code from the second line?",
      "I love your teaching",
      "I did struggle a lot to learn NodeJS. I wasted a lot of time. \nThe problem? I did not know the basics of Javascript in first place. You need to walk before you can run.\nSo I took a few very basic books (books, not complex tutorials!) and learned the fundamentals.\nAfter I learned the basics of Javascript, learning NodeJS became much easier.\nEdit: For those asking about the books, for the very basics I learned with Javascript In Less than 50 Pages. \nAnd to develop my knowledge I learned with Head First Javacript Programming.",
      "I'm here for our capstone project, wish me luck guys.",
      "Whenever I start learning something new I look for the best and the simplest explanation which i get from Mosh all the time",
      "Completed Let's goo",
      "thanks for the video.",
      "Man. I spent months learning React as my first JS framework and it felt very complex and overwhelming to me for the longest time. Now, after starting to dabble in Node, this feels WAY easier than React.",
      "seriously 20 mins in and you already summed up 2 of my university lectures.  No joke, my prof spent that long trying to explain what node actually is. Thank you!",
      "Mosh is it. He carefully breaks down each topic just the way a beginner can process. It just clicks right in. I mean all the complicated topics and concepts that I've been struggling to get. I wish he just keeps making tutorials for all the major programming languages and frameworks out there. I have $15 per month, all accessible subscription through his site and by far the best programming investment I've ever made. My hats off to you, Mosh.  You are the man!",
      "great vid",
      "Thanks Mosh",
      "the way you teach is so satisfying, I can tell you've a lot of experience",
      "Dude, I love watching Your vids. You have one of the most pleasant speaking and teaching styles out there! Plus the content, editing, recording quality, background music... Everything is perfect! Keep up the good work, please! ;)",
      "Understood every single bit of it. Thank you Mosh. Great tutorial !!!",
      "Mosh is a true teacher.",
      "It's a really high-quality tutorial. Thx!",
      "My goodness. You have seriously set the standard for programming tutorials. This is amazing.",
      "This video is finally getting me out of my Python rut, and realizing that async development isn't as hard as I've made it out to be in my head. Fantastic stuff.",
      "These videos are the most fun I've had in a while. I didn't even wanna learn NodeJS tbh, but you made it so appealing that I got my laptop out, downloaded everything, and followed along. You made something that seemed scary to me attainable. Thank you Mosh, you're a real one! I found you from Coder Coder ",
      "Very helpful to get to know what is Node, thanks Mosh!!",
      "Thanks a bunch mosh... You explained it in easiest way..",
      "This was so simple and easily explained! Great job, Mosh!"
  ]
    },
    {
      "id":2,
     "vidSource": "https://www.youtube.com/embed/d2gfJ8UVPDo?" ,
     "title":"Tensei: The Ultimate guide to JWT client side authentication (Stop Using Local Storage !!!)",
     "comments":[
      "The missing part of any JWT courses. Thank you.",
      "I know everyone is hyping that don’t store tokens in local or session storage. But the reality is if your application is vulnerable to XSS attacks then an attacker can high jacks your tokens stored even in http only cookie by triggering an fetch request to his malicious domain with credentials set to true. So I personally think that we should give more focus on preventing any sort of XSS vulnerabilities in our site rather than deciding where we store our tokens. Personally I prefer session storage as it expires when user closes browser tab. Also please note that I am not saying that author is completely wrong. This is a good quality video. Just saying that this approach will also fails if we have XSS vulnerability.",
      "Hello Franz, very nice video!! Great content too! However, you left out something. The cookie holding the refresh token is still susceptible to CSRF attacks. And once that happens, it’s game over. HttpOnly alone won’t save the cookie from CSRF attacks. You need additional settings on the refresh-token cookie  for GraphQL. Namely: Path: /graphql; Domain: localhost:4500; SameSite: Strict. Now, with these additional settings, the refresh-token cookie is not vulnerable to CSRF via abuse of ambient authority on cross-site, cross-domain scenarios",
      "Damnn!! this is what every JWT newbie needs to know how to understand the refresh token & its usage in the front end . Thank you Sir!!!",
      "This was/is a phenomenal video.  Though not titled microservices, this is the only video that I've found that helped me with the front end side of handling APIs.  Thank you for making this.",
      "Important thing to highlight that such an approach is great for web browser applications but not a good idea to follow it if we are creating same Auth API for IOS or Android as they don't have the cookies mechanism.",
      "This is the best I have watch so far on jwt auth.",
      "I searched a lot about these refresh token and access token, finally, I understood what's going on. Thank you sir",
      "You went the extra mile. All the rest in YouTube were lazy or lacking of knowledge or maybe just not as clear as you are. Thanks for your video man!",
      "Thanks for the kind words, I'm always happy to help! Let  know if you'd like any videos on specific topics in the future. I wish you all the",
      "tysm almost a week I searching about the refresh token huhu finally you saved me tysm!",
      "I do not understand why people completely stopped talking about CSRF-attacks. Developers actually stopped using httpOnly cookies and went for localStorage for a reason. Cookies, httpOnly or not, are very much prone to an attack. They are not prone to an XSS-attack but they are prone to a CSRF-attack. localStorage are not prone to CSRF though. And if XSS does happen then even with well protected cookies an attacker has huge power and still is able to make a lot of damage.",
      "There’s nothing wrong with storing tokens in local storage. If your site has XSS vulnerabilities, you have much bigger issues.",
      "'in this tutorial' <3 great vid Kati! thx",
      "Thank you for addressing this topic, there is a lot of misinformation out there. :)",
      "Huh, that was very useful. Thank you. You may have just saved my ass :D",
      "Problem with this method is, if someone gets the refresh token, they may infinitely keep on getting new tokens. \nOne would say, to tackle this issue, keep the expiry time of small duration. \nHowever, it’ll create another issue. Suppose, if I shut down my system and come back the next day, the refresh token would have expired by now. Therefore, I’ll have to log in again. \nWhat could be the potential solution to such problems?",
      "Thanks so much! Every time was missing why the refresh token is even should be used",
      "Great video! have your like good man !",
      "Nice."
  ]
    },
    {
      "id":3,
      "vidSource":"https://www.youtube.com/embed/kwEgcbVSUoc?",
      "title":"[#3] Funds Flow Statement [ Comprehensive problem with adjustment ] :-by kauserwise",
      "comments":[
        "Playlist Cost and management accounting  video collections:\nhttps://www.youtube.com/playlist?list=PLabr9RWfBcnpgUjlVR-znIRMFVF0A_aaA",
        "\"The fear of the Lord is the beginning of wisdom.\"\r\nindeed!\r\nthank you so much, ma'am. this helped me big time for my management accounting exam coming up.\r\nI was so worried and tensed until I found this video.\r\nGod bless you!",
        "Such a motherly way of teaching ",
        "I don't know who you are but YOU ARE A GENIUS.",
        "hello mam i m from chandigarh and your teaching skills is really to good i watch all your videos its helpful for me ..... thank you",
        "Thank you so much",
        "Madam I from Kerala u r genius. Thank u..",
        "I'm from Nepal nd I really enjoyed the way she taught FFO nd other chapters as well. Her videos are really very helpful nd far more satisfying than other youtubers. Thank you!",
        "",
        "Madam I'm from \"PAKISTAN\".......you teach as a great tune & you'r voice is so beautyful",
        "I didn’t even have a single idea of fundflow statement but ma’am you made it so easy and simple for me to understand this..not only I got to know the problem but also general things related to this..Thankyou so much you deserve this️",
        "Like this is called concept clarity everyone tries to memorize but you explained the whole concept. Thankyou so much mam",
        "Thnq soo much ma'am ...",
        "You ma'am are a saviour.\nthanks a lot for your help.\nPeople like you are making the best possible use of Internet to spread education...",
        "Thank you mam. Saved my life during exams. Wish me luck please. I have an exam in about 3 hours.",
        "Bestest ️️️️Teacher Simple and best for STUDENTS WHO ARE LEARNING THIS 1st time...",
        "Thank you mam, Your way of teaching a single sum is so clean, up to method, \nYou must be a PROFESSIONAL TEACHER.",
        "I'm gonna attend in person exam for the first time after pandemic and your teaching  really helped me thank you",
        "Thanks mam\nWhat r u teaching is in very understandable manner.good explainations",
        "Your videos are always helpful. Thank you"
    ]
    },
    {
      "id":4,
      "vidSource":"https://www.youtube.com/embed/4x3pvdV6hzc?",
      "title":"MODERN TALKING - Cheri Cheri Lady (1985, NRK HD Norway)",
       "comments": [
        "Год одна тысяча девятьсот восемьдесят шестой от рождества Христова, пляж Лазаревское, мне ... ну сколько-то лет...\nПодхожу к ларьку, играет вот эта песня! Передо мной взрослый дяденька ( как мне казалось тогда), говорит мне вот эту группу из ФРГ.\nУ меня десять советских рублей, красные, с Лениным. Протягиваю парню за стойкой, говорю мне тоже эту группу из ФРГ . МК-60, второй и третий альбом. С каждой стороны по полторы песни не поместилось на кассету, как потом выяснилось. Но какой же, я был счастливый! В то лето весь наш класс привёз каждый по кассете и все разные исполнители. C.C.Catch, Joy, Silent Circle, Bad Boys Blue, Sandra, Divine, Lian Ross, Baby's Gang, сборники the Best of Italo-Disco и многое другое. Потом всю осень менялись кассетами, переписывали друг у друга.\nВот времена золотые были️",
        "Anyone in 2025 ? ",
        "Is there anyone in 2024.... ?? Who is listening it till today",
        "Anyone in 2025 ? ",
        "Anyone from India listening this",
        "Who is listening to this song in ️2025?",
        "If you ever feel useless remember the guitar in this video",
        "Thomas looks like a young nobleman in oil paintings.",
        "Dude got some dance moves and the guitar action is incredible, he can play it hands free! ",
        "Anyone from India listening this masterpiece",
        "The genz generation is frustrated version, shouting, screaming, yelling.. this is actual music where the singer has real expressions, real voice and pure heart dedicated to music.",
        "I am a 48 year old man from Pakistan and this song is my all time favourite. Myself along with my friends used to listen this song in our school days a lot. Loads of love.",
        "Who are still listening to this masterpiece on February 2024",
        "Anyone in 2024??",
        "เพลงนี้ดังมาตั้งแต่ผมอายุ14 ปัจจุบันผมอายุ54ก็ยังดังอยู่ สุดยอดจริงๆ",
        "Everything is perfect in this video. The hair, the tunic over tight pants, the green tracksuit, the unplugged guitar, the golden plate with a smile on the background...  Nobody did the parody on the 80ies like these guys from the 80ies",
        "Cuantos estan Escuchandola en 2024 ",
        "Dieter Bohlens guitar play is godlike! Skill at the highest level! ",
        "Any one listening  in 2024 ?",
        "He has such beautiful hair. I am jealous "
    ]
    }

    
  ]
